benchmarks/configs/dev-test.yaml
---
execution:
  - scenario: rsa_scenario
    concurrency: 6
    ramp-up: 10s
    hold-for: 1m
    executor: gatling

  - scenario: ecdsa_scenario
    concurrency: 6
    ramp-up: 10s
    hold-for: 1m
    executor: gatling

settings:
  env:
    host: "https://gateway.svc.docker.local:9443"

scenarios:

  rsa_scenario:
    default-address: "https://gateway.svc.docker.local:9443"
    headers:
      Content-Type: application/json

    requests:

      - label: "RSA: GET /keys"
        method: GET
        url: "/keys?algorithmType=RSA&strength=2048"
        extract-jsonpath:
          rsa_2048_id: "[0].id"

      - label: "RSA: GET /keys/{id}/keypair"
        method: GET
        url: "/keys/${rsa_2048_id}/keypair"

      - label: "RSA: POST /certificates"
        method: POST
        url: "/certificates"
        body:
          key_algorithm_id: "${rsa_2048_id}"
          subject:
            organization: "LoadTest Corp"
            organizational_unit: "QA"
            country: "US"
            state_or_province: "CA"
            locality: "San Francisco"
            email: "qa@example.com"
          sans:
            - "rsa.loadtest.example.com"
          validity_days: 365

      - label: "RSA: GET /certificates"
        method: GET
        url: "/certificates?algorithmType=RSA&limit=150&direction=next"

  ecdsa_scenario:
    default-address: "https://gateway.svc.docker.local:9443"
    headers:
      Content-Type: application/json

    requests:

      - label: "ECDSA: GET /keys"
        method: GET
        url: "/keys?algorithmType=ECDSA&strength=384"
        extract-jsonpath:
          ecdsa_id: "[0].id"


      - label: "ECDSA: GET /keys/{id}/keypair"
        method: GET
        url: "/keys/${ecdsa_id}/keypair"

      - label: "ECDSA: POST /certificates"
        method: POST
        url: "/certificates"
        body:
          key_algorithm_id: "${ecdsa_id}"
          subject:
            organization: "LoadTest Corp"
            organizational_unit: "QA"
            country: "US"
            state_or_province: "CA"
            locality: "San Francisco"
            email: "qa@example.com"
          sans:
            - "ecdsa.loadtest.example.com"
            - "ecdsa1.loadtest.example.com"
            - "ecdsa3.loadtest.example.com"
          validity_days: 365

      - label: "ECDSA: GET /certificates"
        method: GET
        url: "/certificates?algorithmType=ECDSA&limit=150&direction=next"


reporting:
  - module: console
  - module: final-stats

modules:
  gatling:
    properties:
      version: 3.13.5
      download-link: "https://repo1.maven.org/maven2/io/gatling/highcharts/gatling-charts-highcharts-bundle/3.13.5/gatling-charts-highcharts-bundle-3.13.5-bundle.zip"