benchmarks/configs/dev-test.yaml
---
execution:
  - scenario: rsa_scenario
    concurrency: 6
    ramp-up: 30s
    hold-for: 5m
    executor: gatling

  - scenario: ecdsa_scenario
    concurrency: 6
    ramp-up: 30s
    hold-for: 5m
    executor: gatling

settings:
  env:
    host: "http://127.0.0.1:9090"

scenarios:

  rsa_scenario:
    default-address: "http://127.0.0.1:9090"
    headers:
      Content-Type: application/json

    requests:
      - label: "RSA: GET /keys"
        method: GET
        url: "/keys?algorithmType=RSA&strength=2048"
        extract-jsonpath:
          rsa_2048_id: "[0].id"
        # think-time: 100ms

      - label: "RSA: GET /keys/{id}/keypair"
        method: GET
        url: "/keys/${rsa_2048_id}/keypair"
        # think-time: 100ms

      - label: "RSA: POST /certificates"
        method: POST
        url: "/certificates"
        body:
          key_algorithm_id: "${rsa_2048_id}"
          subject:
            organization: "LoadTest Corp"
            organizational_unit: "QA"
            country: "US"
            state_or_province: "CA"
            locality: "San Francisco"
            email: "qa@example.com"
          sans:
            - "rsa.loadtest.example.com"
          validity_days: 365
        # think-time: 100ms

      - label: "RSA: GET /certificates"
        method: GET
        url: "/certificates?algorithmType=RSA&limit=150&direction=next"
        # think-time: 100ms

  ecdsa_scenario:
    default-address: "http://127.0.0.1:9090"
    headers:
      Content-Type: application/json

    requests:
      - label: "ECDSA: GET /keys"
        method: GET
        url: "/keys?algorithmType=ECDSA&strength=384"
        extract-jsonpath:
          ecdsa_id: "[0].id"
        # think-time: 100ms

      - label: "ECDSA: GET /keys/{id}/keypair"
        method: GET
        url: "/keys/${ecdsa_id}/keypair"
        # think-time: 100ms

      - label: "ECDSA: POST /certificates"
        method: POST
        url: "/certificates"
        body:
          key_algorithm_id: "${ecdsa_id}"
          subject:
            organization: "LoadTest Corp"
            organizational_unit: "QA"
            country: "US"
            state_or_province: "CA"
            locality: "San Francisco"
            email: "qa@example.com"
          sans:
            - "ecdsa.loadtest.example.com"
            - "ecdsa1.loadtest.example.com"
            - "ecdsa3.loadtest.example.com"
          validity_days: 365
        # think-time: 100ms

      - label: "ECDSA: GET /certificates"
        method: GET
        url: "/certificates?algorithmType=ECDSA&limit=150&direction=next"
        # think-time: 100ms

reporting:
  - module: console
  - module: final-stats

modules:
  gatling:
#    java-opts:
#      - "-Xms3G"
#      - "-Xmx3G"
#      - "-XX:+UseG1GC"
#      - "-XX:MaxGCPauseMillis=100"
#      - "-Djava.net.preferIPv4Stack=true"
#      - "-Djava.net.preferIPv6Addresses=false"

    properties:
      gatling-version: "3.15.1"
      download-link: "https://repo1.maven.org/maven2/io/gatling/highcharts/gatling-charts-highcharts-bundle/3.15.1/gatling-charts-highcharts-bundle-3.15.1-bundle.zip"

#      gatling.conf:
#        gatling.http:
#          dns:
#            queryTimeout: 500
#            maxQueriesPerResolve: 3
#          socket:
#            connectTimeout: 1000
#            tcpNoDelay: true
#            soKeepAlive: false